load-test/attendee-script-642900893.yml
config:
  target: "wss://stage.events.q4inc.com/graphql?x-meeting-id=642900893&x-company-id=62bb11918808f7b6298c3776&ep-wss=true"
  ensure:
    max: 5000 # fail if max response time exceeds 5000ms
    maxErrorRate: 0 # fail if error rate exceeds 0%
  phases:
    - duration: 300           # 5 min
      arrivalRate: 322        # 166 attendee's per second ~ 10k per minute
      name: "Perform Attendee load test 300-322-642900893"
  ws:
    rejectUnauthorized: false
    token: "Bearer
    headers:
      Sec-WebSocket-Protocol: graphql-transport-ws
scenarios:
  - name: "Perform Attendee http journey to console"
    flow:
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          json:
            operationName: "getFeatureFlags"
            query: |
              query getFeatureFlags {
                getFeatureFlags
              }
      - get:
          url: "https://stage.events.q4inc.com/rest/event/642900893"
      - get:
          url: "https://stage.events.q4inc.com/rest/event/features?eventType=earnings"
      - get:
          url: "https://stage.events.q4inc.com/rest/organization/public-user-info?
      - think: 2
      - get:
          url: "https://stage.events.q4inc.com/rest/event/642900893"
      - get:
          url: "https://stage.events.q4inc.com/rest/event/features?eventType=earnings"
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          json:
            operationName: "getFeatureFlags"
            query: |
              query getFeatureFlags {
                getFeatureFlags
              }
      - post:
          url: "https://stage.events.q4inc.com/rest/auth/guest/login"
          json:
            meetingId: "642900893"
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCIsImtpZCI6Ing4dE5RMVY5Zm15MjVwSjFIeDFfVSJ9.eyJpc3MiOiJodHRwczovL2F1dGguc3RhZ2UucTRpbmMuY29tLyIsInN1YiI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyQGNsaWVudHMiLCJhdWQiOiJldmVudHMtcGxhdGZvcm0uYXBwIiwiaWF0IjoxNzE1MTAzMDc5LCJleHAiOjE3MTUxODk0NzksInNjb3BlIjoiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIGF0dGVuZGVlOm1hbmFnZTphdHRlbmRlZSBhdHRlbmRlZTpyZWFkOnF1ZXN0aW9ucyBhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIGF0dGVuZGVlOnZpZXc6YnJvYWRjYXN0IG1lZXRpbmdJZDo2NDI5MDA4OTMgcHVibGljVG9rZW46dHJ1ZSIsImd0eSI6ImNsaWVudC1jcmVkZW50aWFscyIsImF6cCI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyIiwicGVybWlzc2lvbnMiOlsiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIiwiYXR0ZW5kZWU6bWFuYWdlOmF0dGVuZGVlIiwiYXR0ZW5kZWU6cmVhZDpxdWVzdGlvbnMiLCJhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIiwiYXR0ZW5kZWU6dmlldzpicm9hZGNhc3QiLCJtZWV0aW5nSWQ6NjQyOTAwODkzIiwicHVibGljVG9rZW46dHJ1ZSJdfQ.pOBHPbI_FN5aSJw7ugjZd7NZJ61d9Puc2D-ZZugcv_MSq3CDOe3EshzbnyQYYGZCFY2gToy26Rn-q7zsIhz4xW_3_jXdzzkDrhbqaRjgGBB3kbq7ZqwETiEW0FIinJzQOW5k6KsEi_cHKn-EyVrDPDgFK6x6TId0Y89N7WLH35e823ouQDN2aj5205f09kdLvvsZRAl8r17Il1mO0tSuC6zGkjsGKY6Ba1mYa1mN5BwOnn7DU1FYljDnsaVjhK3MHmhDuKzuXQheLe_3R2Dr3S9Xdt281RjfnrosMWE8QTsV4x4kCkj_7PaApnXQDqeMRdKkGVvbzhH57n0iMOuIfg"
          json:
            operationName: "createAttendee"
            query: |
              mutation createAttendee(
                $meetingId: Int!
                $email: String!
                $firstName: String!
                $lastName: String!
                $investorType: InvestorTypeNames
                $attendeeType: AttendeeType
                $companyName: String
                $titleAtCompany: String
                $wsConnectionId: String!
                $controlNumber: String
                $upperShareRange: Int
                $lowerShareRange: Int
                $sendReminderEmail: Boolean
                $registrationType: String
                $type: UserType
                $institutionId: String
                $registrationFieldAnswers: [RegistrationFieldAnswerInput]
              ) {
                createAttendee(
                  meetingId: $meetingId
                  email: $email
                  firstName: $firstName
                  lastName: $lastName
                  investorType: $investorType
                  attendeeType: $attendeeType
                  companyName: $companyName
                  titleAtCompany: $titleAtCompany
                  wsConnectionId: $wsConnectionId
                  controlNumber: $controlNumber
                  upperShareRange: $upperShareRange
                  lowerShareRange: $lowerShareRange
                  sendReminderEmail: $sendReminderEmail
                  registrationType: $registrationType
                  type: $type
                  institutionId: $institutionId
                  registrationFieldAnswers: $registrationFieldAnswers
                ) {
                  id
                  meetingId
                  email
                  firstName
                  lastName
                  investorType
                  attendeeType
                  companyName
                  titleAtCompany
                  wsConnectionId
                  controlNumber
                  hasCompletedAttestationForm
                  upperShareRange
                  lowerShareRange
                  sendReminderEmail
                  registrationType
                  type
                  institutionId
                }
              }
            variables:
              attendeeType: "GUEST"
              email: "loading_test@gmail.com"
              firstName: "Loading"
              investorType: "individual"
              lastName: "Test"
              meetingId: 642900893
              registrationType: "LOBBY"
              type: "GUEST"
              wsConnectionId: "6ae00c1a-1049-4b0f-b2eb-68bc74369a0c"
      - loop:
          - post:
              url: "https://stage.events.q4inc.com/graphql"
              headers:
                Authorization: "Bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCIsImtpZCI6Ing4dE5RMVY5Zm15MjVwSjFIeDFfVSJ9.eyJpc3MiOiJodHRwczovL2F1dGguc3RhZ2UucTRpbmMuY29tLyIsInN1YiI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyQGNsaWVudHMiLCJhdWQiOiJldmVudHMtcGxhdGZvcm0uYXBwIiwiaWF0IjoxNzE1MTAzMDc5LCJleHAiOjE3MTUxODk0NzksInNjb3BlIjoiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIGF0dGVuZGVlOm1hbmFnZTphdHRlbmRlZSBhdHRlbmRlZTpyZWFkOnF1ZXN0aW9ucyBhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIGF0dGVuZGVlOnZpZXc6YnJvYWRjYXN0IG1lZXRpbmdJZDo2NDI5MDA4OTMgcHVibGljVG9rZW46dHJ1ZSIsImd0eSI6ImNsaWVudC1jcmVkZW50aWFscyIsImF6cCI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyIiwicGVybWlzc2lvbnMiOlsiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIiwiYXR0ZW5kZWU6bWFuYWdlOmF0dGVuZGVlIiwiYXR0ZW5kZWU6cmVhZDpxdWVzdGlvbnMiLCJhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIiwiYXR0ZW5kZWU6dmlldzpicm9hZGNhc3QiLCJtZWV0aW5nSWQ6NjQyOTAwODkzIiwicHVibGljVG9rZW46dHJ1ZSJdfQ.pOBHPbI_FN5aSJw7ugjZd7NZJ61d9Puc2D-ZZugcv_MSq3CDOe3EshzbnyQYYGZCFY2gToy26Rn-q7zsIhz4xW_3_jXdzzkDrhbqaRjgGBB3kbq7ZqwETiEW0FIinJzQOW5k6KsEi_cHKn-EyVrDPDgFK6x6TId0Y89N7WLH35e823ouQDN2aj5205f09kdLvvsZRAl8r17Il1mO0tSuC6zGkjsGKY6Ba1mYa1mN5BwOnn7DU1FYljDnsaVjhK3MHmhDuKzuXQheLe_3R2Dr3S9Xdt281RjfnrosMWE8QTsV4x4kCkj_7PaApnXQDqeMRdKkGVvbzhH57n0iMOuIfg"
              json:
                operationName: "getEventBroadcastStatus"
                query: |
                  query getEventBroadcastStatus($meetingId: Int!) {
                    getEventBroadcastStatus(meetingId: $meetingId) {
                      status
                      context
                      startTime
                      broadcastUrl
                    }
                  }
                variables:
                  meetingId: 642900893
          - think: 25
        count: 5  
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCIsImtpZCI6Ing4dE5RMVY5Zm15MjVwSjFIeDFfVSJ9.eyJpc3MiOiJodHRwczovL2F1dGguc3RhZ2UucTRpbmMuY29tLyIsInN1YiI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyQGNsaWVudHMiLCJhdWQiOiJldmVudHMtcGxhdGZvcm0uYXBwIiwiaWF0IjoxNzE1MTAzMDc5LCJleHAiOjE3MTUxODk0NzksInNjb3BlIjoiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIGF0dGVuZGVlOm1hbmFnZTphdHRlbmRlZSBhdHRlbmRlZTpyZWFkOnF1ZXN0aW9ucyBhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIGF0dGVuZGVlOnZpZXc6YnJvYWRjYXN0IG1lZXRpbmdJZDo2NDI5MDA4OTMgcHVibGljVG9rZW46dHJ1ZSIsImd0eSI6ImNsaWVudC1jcmVkZW50aWFscyIsImF6cCI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyIiwicGVybWlzc2lvbnMiOlsiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIiwiYXR0ZW5kZWU6bWFuYWdlOmF0dGVuZGVlIiwiYXR0ZW5kZWU6cmVhZDpxdWVzdGlvbnMiLCJhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIiwiYXR0ZW5kZWU6dmlldzpicm9hZGNhc3QiLCJtZWV0aW5nSWQ6NjQyOTAwODkzIiwicHVibGljVG9rZW46dHJ1ZSJdfQ.pOBHPbI_FN5aSJw7ugjZd7NZJ61d9Puc2D-ZZugcv_MSq3CDOe3EshzbnyQYYGZCFY2gToy26Rn-q7zsIhz4xW_3_jXdzzkDrhbqaRjgGBB3kbq7ZqwETiEW0FIinJzQOW5k6KsEi_cHKn-EyVrDPDgFK6x6TId0Y89N7WLH35e823ouQDN2aj5205f09kdLvvsZRAl8r17Il1mO0tSuC6zGkjsGKY6Ba1mYa1mN5BwOnn7DU1FYljDnsaVjhK3MHmhDuKzuXQheLe_3R2Dr3S9Xdt281RjfnrosMWE8QTsV4x4kCkj_7PaApnXQDqeMRdKkGVvbzhH57n0iMOuIfg"
          json:
            operationName: "getUserControlledSlides"
            query: |
              query getUserControlledSlides($meetingId: Int) {
                getUserControlledSlides(meetingId: $meetingId)
              }
            variables:
              meetingId: 642900893
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCIsImtpZCI6Ing4dE5RMVY5Zm15MjVwSjFIeDFfVSJ9.eyJpc3MiOiJodHRwczovL2F1dGguc3RhZ2UucTRpbmMuY29tLyIsInN1YiI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyQGNsaWVudHMiLCJhdWQiOiJldmVudHMtcGxhdGZvcm0uYXBwIiwiaWF0IjoxNzE1MTAzMDc5LCJleHAiOjE3MTUxODk0NzksInNjb3BlIjoiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIGF0dGVuZGVlOm1hbmFnZTphdHRlbmRlZSBhdHRlbmRlZTpyZWFkOnF1ZXN0aW9ucyBhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIGF0dGVuZGVlOnZpZXc6YnJvYWRjYXN0IG1lZXRpbmdJZDo2NDI5MDA4OTMgcHVibGljVG9rZW46dHJ1ZSIsImd0eSI6ImNsaWVudC1jcmVkZW50aWFscyIsImF6cCI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyIiwicGVybWlzc2lvbnMiOlsiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIiwiYXR0ZW5kZWU6bWFuYWdlOmF0dGVuZGVlIiwiYXR0ZW5kZWU6cmVhZDpxdWVzdGlvbnMiLCJhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIiwiYXR0ZW5kZWU6dmlldzpicm9hZGNhc3QiLCJtZWV0aW5nSWQ6NjQyOTAwODkzIiwicHVibGljVG9rZW46dHJ1ZSJdfQ.pOBHPbI_FN5aSJw7ugjZd7NZJ61d9Puc2D-ZZugcv_MSq3CDOe3EshzbnyQYYGZCFY2gToy26Rn-q7zsIhz4xW_3_jXdzzkDrhbqaRjgGBB3kbq7ZqwETiEW0FIinJzQOW5k6KsEi_cHKn-EyVrDPDgFK6x6TId0Y89N7WLH35e823ouQDN2aj5205f09kdLvvsZRAl8r17Il1mO0tSuC6zGkjsGKY6Ba1mYa1mN5BwOnn7DU1FYljDnsaVjhK3MHmhDuKzuXQheLe_3R2Dr3S9Xdt281RjfnrosMWE8QTsV4x4kCkj_7PaApnXQDqeMRdKkGVvbzhH57n0iMOuIfg"
          json:
            operationName: "createPreCallSession"
            query: |
              mutation createPreCallSession {
                createPreCallSession {
                  sessionId
                  token
                }
              }
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCIsImtpZCI6Ing4dE5RMVY5Zm15MjVwSjFIeDFfVSJ9.eyJpc3MiOiJodHRwczovL2F1dGguc3RhZ2UucTRpbmMuY29tLyIsInN1YiI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyQGNsaWVudHMiLCJhdWQiOiJldmVudHMtcGxhdGZvcm0uYXBwIiwiaWF0IjoxNzE1MTAzMDc5LCJleHAiOjE3MTUxODk0NzksInNjb3BlIjoiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIGF0dGVuZGVlOm1hbmFnZTphdHRlbmRlZSBhdHRlbmRlZTpyZWFkOnF1ZXN0aW9ucyBhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIGF0dGVuZGVlOnZpZXc6YnJvYWRjYXN0IG1lZXRpbmdJZDo2NDI5MDA4OTMgcHVibGljVG9rZW46dHJ1ZSIsImd0eSI6ImNsaWVudC1jcmVkZW50aWFscyIsImF6cCI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyIiwicGVybWlzc2lvbnMiOlsiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIiwiYXR0ZW5kZWU6bWFuYWdlOmF0dGVuZGVlIiwiYXR0ZW5kZWU6cmVhZDpxdWVzdGlvbnMiLCJhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIiwiYXR0ZW5kZWU6dmlldzpicm9hZGNhc3QiLCJtZWV0aW5nSWQ6NjQyOTAwODkzIiwicHVibGljVG9rZW46dHJ1ZSJdfQ.pOBHPbI_FN5aSJw7ugjZd7NZJ61d9Puc2D-ZZugcv_MSq3CDOe3EshzbnyQYYGZCFY2gToy26Rn-q7zsIhz4xW_3_jXdzzkDrhbqaRjgGBB3kbq7ZqwETiEW0FIinJzQOW5k6KsEi_cHKn-EyVrDPDgFK6x6TId0Y89N7WLH35e823ouQDN2aj5205f09kdLvvsZRAl8r17Il1mO0tSuC6zGkjsGKY6Ba1mYa1mN5BwOnn7DU1FYljDnsaVjhK3MHmhDuKzuXQheLe_3R2Dr3S9Xdt281RjfnrosMWE8QTsV4x4kCkj_7PaApnXQDqeMRdKkGVvbzhH57n0iMOuIfg"
          json:
            query: |
              query myQuestion($userEmail: String!) {
                myQuestions(userEmail: $userEmail) {
                  userId
                  text
                  createdAt
                  isAnonymous
                  id
                  upperShareRange
                  lowerShareRange
                }
              }
            variables:
              userEmail: "dmytro.kukharenko@q4inc.com"
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCIsImtpZCI6Ing4dE5RMVY5Zm15MjVwSjFIeDFfVSJ9.eyJpc3MiOiJodHRwczovL2F1dGguc3RhZ2UucTRpbmMuY29tLyIsInN1YiI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyQGNsaWVudHMiLCJhdWQiOiJldmVudHMtcGxhdGZvcm0uYXBwIiwiaWF0IjoxNzE1MTAzMDc5LCJleHAiOjE3MTUxODk0NzksInNjb3BlIjoiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIGF0dGVuZGVlOm1hbmFnZTphdHRlbmRlZSBhdHRlbmRlZTpyZWFkOnF1ZXN0aW9ucyBhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIGF0dGVuZGVlOnZpZXc6YnJvYWRjYXN0IG1lZXRpbmdJZDo2NDI5MDA4OTMgcHVibGljVG9rZW46dHJ1ZSIsImd0eSI6ImNsaWVudC1jcmVkZW50aWFscyIsImF6cCI6IlpCRkp5d0xVSTVzS1ZJVkM0bzA3dll3RUp0Z1lWZUcyIiwicGVybWlzc2lvbnMiOlsiYXR0ZW5kZWU6YmFzZTpwZXJtaXNzaW9uIiwiYXR0ZW5kZWU6bWFuYWdlOmF0dGVuZGVlIiwiYXR0ZW5kZWU6cmVhZDpxdWVzdGlvbnMiLCJhdHRlbmRlZTpzdWJtaXQ6cXVlc3Rpb25zIiwiYXR0ZW5kZWU6dmlldzpicm9hZGNhc3QiLCJtZWV0aW5nSWQ6NjQyOTAwODkzIiwicHVibGljVG9rZW46dHJ1ZSJdfQ.pOBHPbI_FN5aSJw7ugjZd7NZJ61d9Puc2D-ZZugcv_MSq3CDOe3EshzbnyQYYGZCFY2gToy26Rn-q7zsIhz4xW_3_jXdzzkDrhbqaRjgGBB3kbq7ZqwETiEW0FIinJzQOW5k6KsEi_cHKn-EyVrDPDgFK6x6TId0Y89N7WLH35e823ouQDN2aj5205f09kdLvvsZRAl8r17Il1mO0tSuC6zGkjsGKY6Ba1mYa1mN5BwOnn7DU1FYljDnsaVjhK3MHmhDuKzuXQheLe_3R2Dr3S9Xdt281RjfnrosMWE8QTsV4x4kCkj_7PaApnXQDqeMRdKkGVvbzhH57n0iMOuIfg"
          json:
            query: |
              query ($meetingId: Int) {
                getAssets(contentType: "MATERIALS", meetingId: $meetingId) {
                  assets
                }
              }
            variables:
              meetingId: 642900893
  - engine: "wsgql"
    name: "Perform Attendee subscription journey to console"
    flow:
      - think: 1
      - send: {
          "id": "1",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 642900893
            },
            "extensions": {},
            "operationName": "FEATURE_FLAG_SUBSCRIPTION",
            "query": "subscription FEATURE_FLAG_SUBSCRIPTION { onFeatureFlagsChange }"
          }
        }
      - send: {
          "id": "2",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 642900893
            },
            "extensions": {},
            "query": "subscription ($meetingId: Int) {
              onEventStartPeriodUpdated(meetingId: $meetingId) {
                event {
                  meetingId
                  branding {
                    registrationPageBranding {
                      broadridgeTelephoneNumber 
                      broadridgeInternationalTelephoneNumber 
                      title 
                      description 
                      openRegistration 
                      proxyWebsiteLink
                      termsAndConditionsUrl
                    }
                  }
                }
                isEventStarted
              }
            }"
          }
        }
      - send: {
          "id": "3",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 642900893
            },
            "extensions": {},
            "query": "subscription ($meetingId: Int) {
              onAssetsUpdated(meetingId: $meetingId, contentType: SLIDES)
            }"
          }
        }
      - send: {
          "id": "4",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 642900893
            },
            "extensions": {},
            "operationName": "BROADCAST_STATUS_SUBSCRIPTION",
            "query": "subscription BROADCAST_STATUS_SUBSCRIPTION($meetingId: Int) {
              onBroadcastStatusUpdated(meetingId: $meetingId) {
                status
                context
                startTime
                broadcastUrl
              }
            }"
          }
        }
      - send: {
          "id": "5",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 642900893
            },
            "extensions": {},
            "query": "subscription ($meetingId: Int) {
              onEventDisasterRecoveryUpdated(meetingId: $meetingId) {
                enabled
                redirectUrl
              }
            }"
          }
        }
      - send: {
          "id": "6",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 642900893
            },
            "extensions": {},
            "operationName": "QUESTION_STATUS_SUBSCRIPTION",
            "query": "subscription ($meetingId: Int) {
              onEventQuestionSettingUpdated(meetingId: $meetingId) {
                settings {
                  questionEnabled
                }
              }
            }"
          }
        }
      - think: 300